import 'package:flutter/material.dart';

class about extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
        body: CustomScrollView(slivers: <Widget>[
      SliverAppBar(
        expandedHeight: 250.0,
        pinned: true,
        flexibleSpace: FlexibleSpaceBar(
          title: Text(
            "الحبيب ابوبكر إبن علي المشهور",style: TextStyle(fontFamily: "Stc"),
            textAlign: TextAlign.center,
          ),
          centerTitle: true,
          background: Image.asset(
            "assets/pic/alhabib.jpg",
            fit: BoxFit.cover,
          ),
        ),
      ),
      SliverList(
          delegate: SliverChildListDelegate([
        Padding(
          padding: const EdgeInsets.all(10.0),
          child: Text(
            "بِسْمِ اللّهِ الرَّحمَنِ الرَّحِيمِ الحمدُ للّهِ الذي جَعَلَ الذِّكْرَ رِفْعَةً وعِزَّةً للذاكرين، فقال تعالى : { فاذكُرُونِي أَذْكُرْكُمْ}، وقال تعالى: { ولَذِكْرُ اللّهِ أَكْبَرُ }، وجَعَلَ سبحانه ذِكْرَهُ لازماً وواجباً على المؤمنين، بقوله : { يا أيُّها الَّذِينَ آمَنُوا اذْكُرُوا اللّهَ ذِكْراً كثيراً. وسَبِّحُوهُ بُكْرَةً وأصيلاً }، وفي هذه الآيةِ ومثلِها إشاراتٌ واضحةٌ لترتيبِ وظائف الأوقات بالأذكار والأوراد والصلوات، ومَن هَيَّأَهُ اللّهُ مِنَ السالكينَ لهذا الأمرِ فقد رَبِحَ البَيعَةَ ونال البُغْيَةَ في الدارَينِ، لحديثه صلى اللّه عليه وعلى آله وسلم : ((سَبَقَ المفَرِّدُون)) ثلاثاً، قالوا : ومَنِ المفَرِّدُونَ يا رسولَ اللّه ؟ قال : ((الذَّاكِرُونَ اللّهَ كَثيراً))، اللّهم اجعلنا وأحبابَنا وإخوانَنا المسلمين وكافَّةَ المؤمنين منهم، اللّهم آمين. والصلاةُ والسلامُ على سَيِّدِنا محمَّدٍ الموصوفِ بالذِّكْرِ والشُّكْر وأعمالِ الفِكْرِ والبِرّ، والمأمورِ به في قوله تعالى: {واذْكُرْ رَبَّكَ في نَفْسِكَ تَضَرُّعاً وخِيفَةً ودُونَ الجَهْرِ مِنَ القَوْلِ بالغُدُوِّ والآصالِ ولا تَكُن مِّنَ الغافِلِين}، وصلى اللّه على آله وأصحابه ومَن تَبِعَهُمْ بإحسانٍ إلى يوم الدين. وبَعْدُ فهذا مختصرٌ لطيفٌ جمعناه لطلابِ الأربطةِ الدينيةِ ومراكزها التعليمية، يحوي بعضَ ترتيبِ وظائفِ الأوقاتِ للمبتدئ في طريق السلوك، اقتبسناهُ من كُتُبِ الأوراد والأذكار المشهورة، كـ((المسْلَكِ القَرِيب)) و((مُخِّ العِبادَةِ)) و((وَسِيلَةِ العِباد)) وغيرها، ولم نتوسعْ في ذكرِ أو إيرادِ الأدعية المطوَّلة رغبةً في اختصارِ الأمر للطالب المبتدئ، ولِيَكُونَ له في الوقتِ مُتَّسَعٌ للدراسةِ والحفظِ وطلبِ العلم النافع. ومتى ما وَجَدَ الطالبُ المجِدُّ في نفسِه هِمَّةً ووقتاً للازديادِ من الأذكار والأوراد وقراءةِ القرآن والقيام بالوظائفِ الروحية ؛ فلْيَغْتَرِفْ من ذلك البحر، ولْيَحْرِصْ على التَّوَسُّعِ من الكتب والمؤلفات المعْتَنِيَةِ بهذه الشعائر، واللّه ولي التوفيق.",
            textDirection: TextDirection.rtl,
            style: TextStyle(fontSize: 18.0),
            textAlign: TextAlign.center,
          ),
        ),
      ]))
    ]));
  }
}
